<?php

// +----------------------------------------------------------------------
// | 日志设置
// +----------------------------------------------------------------------
return [
    // 默认日志记录通道
    'default' => 'file',
    
    // 日志记录级别
    'level' => [],
    
    // 日志通道列表
    'channels' => [
        'file' => [
            // 日志记录方式
            'type' => 'File',
            // 日志保存目录
            'path' => runtime_path() . 'log',
            // 单文件日志写入
            'single' => true,
            // 单文件日志文件名
            'file' => 'import.log',
            // 使用JSON格式记录
            'json' => false,
            // 最大日志文件数量
            'max_files' => 0,
            // 日志格式化
            'format' => '[%s][%s] %s'
        ],
    ],
];
